// L.CL(L.n())
// L.CL(L.name)
// L.name = 'qqq'
// L.CL(L.name)
// L.version = "333"

p = k => {
    if (k<1 || k>10) { k = 10 }
    let i = k
    numToStr = (i) => {
        var a = ["ноль поросят", "один поросенок", "два", "три", "четыре", "пять", "шесть", "семь",
                 "восемь", "девять", "десять"]
        for (let i=2; i<=10; i++) { 
            if (i<=4) { a[i] = a[i] + " поросенка" } else { a[i] = a[i] + " поросят" }
        }
        return a[i]
    }
    return () => {
        L.CGe(i)
        let t
        if (i>1) {
            t = `${numToStr(i)} пошли купаться в море
${numToStr(i)} резвились на просторе
Один из них утоп, ему сковали гроб
И вот вам результат: ` + numToStr(--i) + '.'
        } else {
            i = k
            t = `Один поросенок пошел купаться в море
Один поросенок резвился на просторе
Но он не утонул. Нашел себе свинью.
И вот вам результат: ${numToStr(k)}.`
        }
        L.CL(t)
    }
}
f = p(10)
// f()
// f()
// f()
for (let i = 1; i <= 12; i++) {
    f()
}

g = p(10)
for (let i =1; i <= 10; i++) {
    g()
}